example/example.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-09 Thu 23:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Elis Popescu" />
<link rel="stylesheet" type="text/css" href="https://elisescu.github.io/org-timeline/css/timeline.css" />
</head>
<body>
<div id="content">

<div id="outline-container-orgf22b69e" class="outline-2 timeline-head">
<h2 id="orgf22b69e">Header of the timeline</h2>
<div class="outline-text-2" id="text-orgf22b69e">
<p>
The rest of the page will render a timeline of events. You won't believe what happened next.
</p>
</div>
</div>

<div id="outline-container-org3ebfd89" class="outline-2 timeline-container">
<h2 id="org3ebfd89">Timeline</h2>
<div class="outline-text-2" id="text-org3ebfd89">
</div>
<div id="outline-container-org93a3728" class="outline-3">
<h3 id="org93a3728">2019-01-09 Thu</h3>
<div class="outline-text-3" id="text-org93a3728">
</div>
<div id="outline-container-org07e9045" class="outline-4">
<h4 id="org07e9045">Sefinissimo</h4>
<div class="outline-text-4" id="text-org07e9045">
<p>
Nibh donec vitae laoreet odio phasellus duis integer semper, ultricies hendrerit quisque aliquam et posuere sociis augue, aenean rutrum at lacinia tempor interdum vivamus. Congue quam aliquam eleifend massa tellus velit donec ut, penatibus fermentum faucibus augue lacinia porta inceptos nec, sagittis himenaeos ultrices magnis pellentesque dignissim scelerisque. Iaculis varius ut euismod inceptos netus nec pulvinar sodales magnis nullam pharetra conubia quis volutpat hac, senectus a torquent etiam per augue malesuada quisque enim nostra est leo imperdiet lectus.
</p>
</div>
</div>
</div>
<div id="outline-container-org93b5204" class="outline-3">
<h3 id="org93b5204">2019-03-11 Thu</h3>
<div class="outline-text-3" id="text-org93b5204">
</div>
<div id="outline-container-org90bcf3b" class="outline-4">
<h4 id="org90bcf3b">Thursday, some other day</h4>
<div class="outline-text-4" id="text-org90bcf3b">
<p>
Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.
</p>
</div>
</div>
</div>
<div id="outline-container-org9024575" class="outline-3">
<h3 id="org9024575">2019-04-13 Wed</h3>
<div class="outline-text-3" id="text-org9024575">
</div>
<div id="outline-container-orgc1957c7" class="outline-4">
<h4 id="orgc1957c7">And that was it</h4>
<div class="outline-text-4" id="text-orgc1957c7">
<p>
Pretium lobortis nullam iaculis sociis feugiat volutpat netus, lectus tempor dictum risus justo torquent pellentesque cubilia, fermentum mauris est facilisis scelerisque eget. Aenean proin ac cras eget pretium dignissim turpis malesuada bibendum id eros libero quis felis, accumsan primis himenaeos lacus cursus morbi nulla placerat volutpat blandit imperdiet dapibus ligula. Aptent fringilla euismod enim ante lacinia, malesuada orci sollicitudin cursus erat, quam primis commodo ligula. Mollis primis congue ac augue feugiat maecenas fermentum, tincidunt in cursus ligula ultricies condimentum, tempor morbi suscipit netus parturient torquent.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Elis Popescu</p>
<p class="date">Created: 2019-05-09 Thu 23:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
